Revit 2024 API
ElementTypeDuplicatingEventArgs.ElementTypeId Property
 The id of the ElementType to be duplicated.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId ElementTypeId { get; }
Visual Basic
Public ReadOnly Property ElementTypeId As ElementId
	Get
Visual C++
public:
property ElementId^ ElementTypeId {
	ElementId^ get ();
}
See Also
ElementTypeDuplicatingEventArgs Class
Autodesk.Revit.DB.Events Namespace